## staging: api_gateway
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 6 to add, 1 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_api_gateway_deployment.metrics must be replaced
+/- resource "aws_api_gateway_deployment" "metrics" {
      ~ created_date  = "2021-12-01T19:26:09Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:ca-central-1:005133826942:rpjvmf2ukd/" -> (known after apply)
      ~ id            = "8pv4ko" -> (known after apply)
      ~ invoke_url    = "https://rpjvmf2ukd.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = {
          - "redeployment" = "2021-12-01T19:26:09Z"
        } -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

  # aws_api_gateway_stage.metrics will be updated in-place
  ~ resource "aws_api_gateway_stage" "metrics" {
      ~ deployment_id         = "8pv4ko" -> (known after apply)
        id                    = "ags-rpjvmf2ukd-staging"
        tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_policy.write_waf_logs will be created
  + resource "aws_iam_policy" "write_waf_logs" {
      + arn         = (known after apply)
      + description = "Allow writing WAF logs to S3"
      + id          = (known after apply)
      + name        = "write-waf-logs"
      + path        = "/"
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:PutObject",
                          + "s3:ListBucketMultipartUploads",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                          + "s3:AbortMultipartUpload",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::cbs-satellite-005133826942/waf_acl_logs/*",
                          + "arn:aws:s3:::cbs-satellite-005133826942",
                        ]
                      + Sid      = "S3PutObjects"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id   = (known after apply)
      + tags        = {
          + "CostCentre" = "CovidShield"
          + "Terraform"  = "true"
        }
      + tags_all    = {
          + "CostCentre" = "CovidShield"
          + "Terraform"  = "true"
        }
    }

  # aws_iam_role.write_waf_logs will be created
  + resource "aws_iam_role" "write_waf_logs" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "firehose.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "write-waf-logs"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "CostCentre" = "CovidShield"
          + "Terraform"  = "true"
        }
      + tags_all              = {
          + "CostCentre" = "CovidShield"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # aws_iam_role_policy_attachment.write_waf_logs will be created
  + resource "aws_iam_role_policy_attachment" "write_waf_logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "write-waf-logs"
    }

  # aws_kinesis_firehose_delivery_stream.covid_metrics_waf_logs will be created
  + resource "aws_kinesis_firehose_delivery_stream" "covid_metrics_waf_logs" {
      + arn            = (known after apply)
      + destination    = "extended_s3"
      + destination_id = (known after apply)
      + id             = (known after apply)
      + name           = "aws-waf-logs-covid-metrics"
      + tags           = {
          + "CostCentre" = "CovidShield"
          + "Terraform"  = "true"
        }
      + tags_all       = {
          + "CostCentre" = "CovidShield"
          + "Terraform"  = "true"
        }
      + version_id     = (known after apply)

      + extended_s3_configuration {
          + bucket_arn         = "arn:aws:s3:::cbs-satellite-005133826942"
          + buffer_interval    = 300
          + buffer_size        = 5
          + compression_format = "GZIP"
          + prefix             = "waf_acl_logs/AWSLogs/005133826942/covid-metrics/"
          + role_arn           = (known after apply)
          + s3_backup_mode     = "Disabled"

          + cloudwatch_logging_options {
              + enabled         = (known after apply)
              + log_group_name  = (known after apply)
              + log_stream_name = (known after apply)
            }
        }

      + server_side_encryption {
          + enabled  = true
          + key_type = "AWS_OWNED_CMK"
        }
    }

  # aws_wafv2_web_acl_logging_configuration.covid_metrics_waf_logs will be created
  + resource "aws_wafv2_web_acl_logging_configuration" "covid_metrics_waf_logs" {
      + id                      = (known after apply)
      + log_destination_configs = (known after apply)
      + resource_arn            = "arn:aws:wafv2:ca-central-1:005133826942:regional/webacl/metrics_collection1/378af4bf-0cc4-466d-b45f-68231da0cb7a"
    }

Plan: 6 to add, 1 to change, 1 to destroy.

Changes to Outputs:
  ~ base_url = "https://rpjvmf2ukd.execute-api.ca-central-1.amazonaws.com/" -> (known after apply)

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>